/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   param_validation.c                                 :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: dtaisha <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/09/19 16:53:46 by dtaisha           #+#    #+#             */
/*   Updated: 2020/09/19 16:54:14 by dtaisha          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "fractol.h"

// Тут будем смотреть аргументы поданные в программу. нужно будет прописать
// название файлов которые будут содержать настройки
void	param_validation(char *param_name)
{
	if (ft_strcmp(param_name, "1") != 0)
		if (ft_strcmp(param_name, "2") != 0)
			if (ft_strcmp(param_name, "3") != 0)
}
